title: New Service Registered via Registry
id: b0000001-0000-0000-0000-000000000029
name: registry_services
status: stable
description: A new service ImagePath was set in the registry — common persistence and privilege escalation technique.
author: WinStride CCDC
date: 2025-01-01
tags:
    - attack.persistence
    - attack.t1543.003
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: '\SYSTEM\CurrentControlSet\Services\'
        TargetObject|endswith: '\ImagePath'
    filter_trusted:
        Image|endswith:
            - '\services.exe'
            - '\msiexec.exe'
            - '\TiWorker.exe'
            - '\TrustedInstaller.exe'
            - '\svchost.exe'
    condition: selection and not filter_trusted
level: medium
