title: Svchost Executed with Non-Standard Parent
id: b0000001-0000-0000-0000-000000000034
name: svchost_wrong_parent
status: stable
description: svchost.exe was launched by a process other than services.exe — indicates process masquerading or process injection.
author: WinStride CCDC
date: 2025-01-01
tags:
    - attack.defense-evasion
    - attack.t1036.005
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\svchost.exe'
    filter_normal:
        ParentImage|endswith: '\services.exe'
    filter_msiexec:
        ParentImage|endswith: '\MsiExec.exe'
    condition: selection and not filter_normal and not filter_msiexec
level: high
