title: PowerShell Constrained Language Mode Bypass
id: b0000002-0000-0000-0000-000000000012
name: ps_clm_bypass
status: stable
description: A PowerShell script attempts to bypass Constrained Language Mode — used to execute unrestricted code in locked-down environments.
author: WinStride CCDC
date: 2025-01-01
tags:
    - attack.defense-evasion
    - attack.t1059.001
logsource:
    category: ps_script
    product: windows
detection:
    selection_lockdown:
        ScriptBlockText|contains: '__PSLockdownPolicy'
    selection_language:
        ScriptBlockText|contains|all:
            - 'LanguageMode'
            - 'FullLanguage'
    condition: 1 of selection_*
level: critical
