title: PowerShell Suspicious Host Application Flags
id: b0000002-0000-0000-0000-000000000011
name: ps_suspicious_host_app
status: stable
description: A PowerShell command was executed with hidden window and no profile flags — common in malicious scripts and C2 frameworks.
author: WinStride CCDC
date: 2025-01-01
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    category: ps_module
    product: windows
detection:
    selection:
        ContextInfo|contains|all:
            - '-nop'
            - '-w hidden'
    condition: selection
level: medium
