title: Impacket/Metasploit PsExec Service Installation
id: a0000001-0000-0000-0000-000000000031
name: impacket_psexec
status: stable
description: A service was installed with a randomly-generated name and path typical of Impacket psexec.py or smbexec.py lateral movement tools.
author: WinStride CCDC
date: 2025-01-01
tags:
    - attack.lateral-movement
    - attack.t1021.002
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4697
    sus_cmd:
        ServiceFileName|contains:
            - '%COMSPEC%'
            - 'cmd.exe /Q /c'
    sus_path:
        ServiceFileName|re: '(?i)^%systemroot%\\\\[a-zA-Z]{8}\.exe$'
    filter_psexec:
        ServiceName: 'PSEXESVC'
    condition: selection and (1 of sus_cmd or 1 of sus_path) and not filter_psexec
level: critical
