title: Computer Account Created
id: a0000001-0000-0000-0000-000000000019
name: computer_account_created
status: stable
description: A new computer account was created. Red teams abuse the default ms-DS-MachineAccountQuota to create machine accounts for resource-based constrained delegation attacks.
author: WinStride CCDC
date: 2025-01-01
tags:
    - attack.persistence
    - attack.t1136.002
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4741
    condition: selection
level: high
