title: Member Added to Local Administrators
id: a0000001-0000-0000-0000-000000000005
name: added_to_local_admins
status: stable
description: A user was added to the local Administrators group. This is the most common CCDC persistence technique.
author: WinStride CCDC
date: 2025-01-01
tags:
    - attack.persistence
    - attack.t1098
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4732
        TargetUserName: 'Administrators'
    condition: selection
level: critical
