title: Failed Logon - Wrong Password
id: a0000001-0000-0000-0000-000000000020
name: failed_logon_bad_password
status: stable
description: Failed logon attempt due to incorrect password. High volumes indicate brute force or password spraying.
author: WinStride CCDC
date: 2025-01-01
tags:
    - attack.credential-access
    - attack.t1110
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4625
    status_match:
        - Status: '0xC000006A'
        - SubStatus: '0xC000006A'
    condition: selection and 1 of status_match
level: low
